image bg room39 = "images/39.png"


# 两下屏幕震动的 transform（可调整偏移与时长）
transform screen_shake:
    xalign 0.5
    yalign 0.5

    linear 0.04 xoffset -18
    linear 0.04 xoffset 18
    linear 0.04 xoffset -12
    linear 0.04 xoffset 12
    linear 0.02 xoffset 0

label week4:
define music11 = "audio/手机震动.mp3"
scene bg room38
"......"
"......"
scene bg room39
"week4"
"......"
"今天要干什么呢？"
$ wu_head_img = "images/1.png"
menu:
    "再想想吧......":
        if baozi_score >= 5:
            pass
        else:
            jump week5
    "什么也不思考......":
        "什么也不想管。"
        "就这样吧。"
        "一个人呆着就好。"
        jump week5
n11 "......"
n11 "我应该怎么办......"
n11 "我还可以干些什么......"
scene black with Dissolve(3.0) 
play music music11
show bg room39 at screen_shake
pause 0.2
show bg room39
"电话？"
"谁？"
stop music fadeout 5.0
n11 "喂？"
"奉孝" "早上好~看来今天不是我睡过了呢。"
"奉孝" "等了好久没等到你的电话，怎么还要我来叫你？"
"......"
n11 "......抱歉，我......"
"奉孝" "生病了吗？还是哪里不舒服？"
n11 "不......我没事......"
n11 "我没事......"
"奉孝" "你等一下，我马上来。"
n11 "没事的，让我一个人————"
"嘟嘟————"
"被挂断了。"
"......"
"先......收拾一下吧......"

scene black with Dissolve(3.0) 
"......"
scene bg room3
define music12 = "audio/doorbell2.mp3"
play music music12
$ guo_head_img = "images/2.1.png"
define music13 = "audio/真実.mp3"
play music music13

n2 "早上好紫鸾君！今天是去上学，还是翘课去玩~"
n2 "总之在床上躺一天直接pass!"
$ wu_head_img = "images/000.png"
$ guo_head_img = "images/000.png"
image bg room40 = "images/40.png"
image bg room41 = "images/41.png"
image bg room42 = "images/42.png"
image bg room43 = "images/43.png"
image bg room44 = "images/44.png"
image bg room45 = "images/45.png"
scene bg room40
n11 "......"
n11 "我真的没事......"
n11 "我只是有一点累，让我一个人呆着吧。"
scene bg room41
n2 "......"
n2 "盯————"
scene bg room40
n11 "真的，奉孝，我没事。"
scene bg room41
n2 "那......"
n2 "要和我去约会吗？"
"？"
n2 "机会难得哦~我可是很受欢迎的，情人节想给我巧克力的人可是要排队到校门外呢。"
"听他这么说着，感觉到轻松一点了。"
scene bg room40
n11 "那么这位人气王，和你约会有什么好处吗？"
scene bg room41
n2 "你可以和我一起去吃饭，一起去游戏厅，一起看电影。"
scene bg room42
n11 "和我们平时干的事差不多呢。"
scene bg room41
n2 "对啊，那要和我去吗？"
"他向我伸出了手。"
scene bg room42
"我明白，如果我现在不握住的话，可能会后悔一辈子。"
scene bg room43
"......"
"还好有奉孝在我身边。"
scene bg room44
n11 "还好有你在。"
n2 "我当然在。"
"我这才第一次正眼看他。"
"奉孝，明明看起来也不开心......"
scene bg room45
"？"
"也对，之前也是......"
"要问他吗？"
menu:
        "和别人上床舒服吗？":
            scene bg room3
            $ wu_head_img = "images/1.1.png"
            $ guo_head_img = "images/2.1.png"
            n2 "......这个......"
            n2 "有点难解释。"
            n2 "反正不是你想的那样......"

        "还是算了":
            scene bg room3
            $ wu_head_img = "images/1.1.png"
            $ guo_head_img = "images/2.1.png"
            stop music fadeout 5.0
            n11 "走吧。"
            n11 "我们先去买零食。"
            n11 "剩下的你来安排。"
            n2 "没问题，交给我吧。"
            jump week4_2
menu:
    "和我不行吗？":
        $ baozi_score += 1
        n11 "和我不行吗？"
        jump week4_1

label week4_1:
n2 "不是，紫鸾......不是那样的......"
n11 "今天结束，和我睡吧。"
n2 "不是的......"
n2 "这种事要和喜欢的人做......"
n2 "......"
"他有些慌张。"
"我貌似说错话了。"
n11 "抱歉，奉孝，我......"
n11 "我开个玩笑。"
n2 "哦？"
stop music fadeout 5.0
n2 "嗯......没事，那今天你可要陪我好好玩。"
n11 "不是你来陪我的吗？"
n2 "差不多差不多~"
scene black

label week4_2:
scene black
define music14 = "audio/Sentimentally.mp3"
play music music14 

play movie "images/1.webm"
$ renpy.pause(6.0, hard=True)
stop movie

image bg room46 = "images/46.png"
scene bg room46
n11 "说是玩......"
n11 "儿童乐园也太返璞归真了吧。"
n2 "这附近小孩看见高中生都不敢靠近的。"
n2 "所以是被我们独占的乐园。"
n2 "只有我们。"
n11 "这样听起来不错，不过我们会不会太显眼。"
n2 "两个帅哥当然显眼。"
n11 "我的意思是，巡逻的警察看见我们的制服，会把我们抓回学校吧。"
n2 "你说的有道理。"
n2 "到时候我们跑就行！"
n2 "嗯。"
n2 "总之我要先玩秋千，紫鸾能麻烦你先推我一下吗，我要试一下360°。"
n11 "你小心一点......"
"......"
"......半小时后......"
"巡警" "你们两个！这个时间不去上学在干什么！"
n2 "糟糕，我的360还没成功......"
"巡警" "还在儿童乐园玩这么危险的游戏！快告诉我你们的名字！"
n2 "紫鸾！跑！"
"他从秋千上一跃而下，提起自己的包就开始跑。"
"......"
"这次连180°都没达到呢，下次再试试吧。"

image bg room47 = "images/47.png"
scene bg room47
n2 "呼......好险！"
n2 "迟到都没这么跑过！"
n11 "那是当然啊，现在可是逃学，比迟到严重多了。"
n2 "对啊......"
n2 "反正都逃了......"
n2 "应该不会追上来了，紫鸾你要喝饮料吗？"
n11 "要。"
n2 "你要什么口味的？"
n11 "姜汁汽水。"
n2 "呜哇，你喜欢这么诡异的东西啊。"
n11 "我喜欢啊，你讨厌姜味？"
n2 "嗯......很刺激啊......"
n11 "说起来只聊过我喜欢的食物啊，你呢？"
n2 "我吗，吃的没什么特别的，不过饮料......酒吧。"
n11 "喂，高中生，怎么喜欢喝酒的，果然是不良啊。"
n2 "对啊，就是不良，现在正在带坏转校生呢。"
"......"
"下次偷偷买点酒来喝吧。"
"也许可以去他家。"

image bg room48 = "images/48.png"
scene bg room48
n11 "刚才买了饮料，现在又来咖啡店。"
n2 "喝够了当然要吃啊，这家店的蛋糕什么的很好吃的，而且很漂亮的。"
n11 "甜食啊......没什么特别喜欢的类型呢......"
n2 "顺便一提这家的炸鸡块也很好吃。"
n11 "要这个。"
"......"
"其实是甜党啊。"

image bg room49 = "images/49.png"
scene bg room49
n11 "书店啊......有什么要买的吗？"
n2 "之前在追的连载的漫画出新的一卷了，想买来看看。"
n2 "准确来说很久没追了，听说最新的有我喜欢的角色的高光。"
"他在一排排漫画里找了好久，最后抽出来一本很眼熟的漫画。"
n2 "就是这个！"
"啊，之前确实看过。"
n11 "我看过这部，一直跟着进度追的，你喜欢哪个角色？"
n2 "这个这个。"
"他指向了封面上一个角色。" 
n11 "啊，这个角色啊......"
"这一本里面应该是......死了。"
n2 "按照之前的剧情发展，这一本他应该死了吧。"
"他开始翻看手中的漫画，翻到了角色死亡画面的那一页。"
n2 "果然。"
n11 "......"
n11 "不会感到伤心，或是遗憾吗？"
n2 "不会。"
n2 "喜欢的角色，即使死了的画面也是如此唯美，更喜欢了。"
n2 "去结账吧，就买这本了。"
"......"
"这个角色......嗯，原来是喜欢这种类型的。"

image bg room50 = "images/50.png"
scene bg room50
n11 "为什么买了书又要来图书馆啊？"
n2 "哼哼，这下不知道了吧。"
n2 "市立图书馆不仅有书，还可以借游戏。"
n2 "看官网说今天上架了一款我很感兴趣的游戏。"
n2 "顺便一提我家有游戏机哦，有空可以来我家玩。"
n11 "啊，原来是这样啊......"
n11 "是什么样的游戏呢？"
n2 "三国时期历史相关的，无双类游戏的新作。"
"嗯......有听说过。"
n11 "没玩过这种呢......"
n2 "看预告片感觉超有意思，而且新主角超帅的————"
"他看向了我。"
n2 "我说我怎么这么喜欢这主角的脸，像你。"
n11 "啊？"
n11 "你要这么说，我有点兴趣了。"
n2 "对吧，但是这里只有一份，所以我这周先玩，你下周玩吧。"
n11 "好啊。"
"......"
"果然还是，更喜欢脸吗？"

image bg room51 = "images/51.png"
scene bg room51
"啊......时间过得好快......"
"怎么已经是傍晚了......"
n2 "要晚上了呢，时间过得好快。"
n11 "是啊......"
n2 "这样的话，先吃饭吧，晚上有一个我必须要带你去的地方。"
n11 "嗯。"
"......"
"稍微有一点期待。"

image bg room52 = "images/52.png"
scene bg room52
n11 "居酒屋，完全不意外。"
n11 "要买酒吗？还穿着制服呢。"
n2 "等不穿的时候再来喝，这家咖喱猪排饭很好吃的，你绝对会喜欢。"
n11 "啊......好啊。"
n11 "那你平时会穿常服偷偷来喝酒吗？"
n2 "会啊，稍微打扮一下就像大人了。"
n2 "我经常会被评价像牛郎呢。"
n11 "牛郎......"
n11 "那你会被人搭讪吧？"
n2 "会啊，不过我都拒绝了。"
n11 "啊......好吧。"
n2 "打扮一下是为了偷偷喝酒呢，不能忘了自己原本的目标。"
n11 "嗯......"
"......"
"那样的常服，想看啊......"

image bg room53 = "images/53.png"
scene bg room53
n2 "然后，这里就是我们的目的地。"
n11 "神社？"
n2 "没错，神社，这个时间应该没什么人来。"
n2 "来许愿吧，许个愿望。"
n2 "这里的神明很灵的，绝对能实现的。"
n11 "愿望吗......"
n11 "我......"
"我希望......"
"我希望接下里的日子里我能幸福。"
"我希望每天都能和你在一起。"
"我希望我们都能幸福。"
"......"
n2 "......"
n2 "好了？"
n11 "嗯......好了。"
n2 "那我们回去吧。"
n2 "我也好好许愿了。"
n11 "嗯......"
"......"
image bg room56 = "images/56.png"
image bg room0 = "images/02.png"
menu:
        "回去吧。":
            jump week5
        "亲他":
            $ baozi_score += 1
            scene bg room0
            "......"
            scene bg room0
            "或许是氛围刚好吧，我不由自主地将手伸向奉孝。"
            scene bg room56 with Dissolve(5.0)
            "他也没有躲开，而是闭上了眼睛。"
            "我能感受到他的手也抚上了我的背。"
            "......"
            "这样就好......"
            "就这样再呆久一点......"
            "......"
            scene bg room53
            stop music fadeout 10.0
            n2 "......"
            "被奉孝推开了。"
            n11 "奉孝，我......"
            "我喜欢你？不对，感觉不是这种......"
            n2 "嗯，大晚上两个人这样在这里，气氛是有点暧昧了。"
            n2 "没事的，我可以理解。"
            n2 "那么，为了不让我们再走错一步，快回家吧。"
            "......"
            "好像搞砸了......"
            "他好像有点尴尬了......"
            "还是回去吧。"
            jump week5



return