transform scroll_up:
    yalign 1.0   # 从底部开始显示
    linear 4.0 yalign 0.0   # 4秒滚动到顶部

label week7:
scene bg room0
"......"
scene bg room3
"week7"

if baozi_score == 0:
        jump bad_ending
else:
        jump week7_1

label bad_ending:
scene bg room3
"一成不变的枯燥的日子流转着。"
"不知道有多久没有见过别人。"
"门外传来了不寻常的敲门声。"
"是寻久未见的亲戚。"
"“你别在这里呆了，走吧。”"
"接着帮我收拾包，匆匆离开了这个城市。"
scene bg room0
scene bg room00
"“我不会指责你没去学校，你知道你同班的guofengxiao的事吗？”"
"......"
"谁？"
"“没事，不熟最好，我们走了，转学手续给你办好了，之后不会回这里了。”"
"嗯。"
"......"
"天气很烂，一直在下雨。"
"天空太黑了，让我分不清黑夜和白天。"
"end1/4"
"陌生人"
return

label week7_1:
define music18 = "audio/憧れはそのままで.mp3"
"奉孝一周没有回我消息。"
"即使去他家找他，也没有得到回应。"
"去学校，老师也只是说他请假了。"
$ wu_head_img = "images/1.png"
n11 "奉孝......"
n11 "不想理我了吗......"
n11 "还是说出事了......"

if baozi_score >= 9:
        stop music
        jump he

elif baozi_score >= 5:
        jump ne

elif baozi_score >= 1:
        jump be

label he:
image bg room68 = "images/68.png"
image bg room69 = "images/69.png"
image bg room70 = "images/70.png"
image bg room71 = "images/71.png"
image bg room72 = "images/72.png"
image bg room73 = "images/73.png"
image bg room76 = "images/76.png"
image bg room77 = "images/77.png"

define music20 = "audio/忍び寄る邂逅.mp3"
define music21 = "audio/プリマヴェーラ.mp3"
"学校......"
n11 "对了......"
n11 "还有那些，奉孝带我去过的......"
n11 "学校很大，嗯......"
n11 "绝对是......"
play music music20 fadein 5.0
scene bg room62
"不是在他家里......"
"绝对是在学校。"
scene bg room68
"我知道的......"
scene bg room69
"他在那里......"
scene bg room70
"他们在这里......"
scene bg room71
"？" "哎呀？你来了？"
"？" "终于要加入我们了吗？"
"？" "正好我们今天第一次准备多人来着，之后再轮流来。"
"？" "奉孝应该还睡着。"
$ wu_head_img = "images/1.8.png"
n11 "你们......"
n11 "闭嘴。"
"我冲了上去。"
"我揪住离我最近的那个混蛋，拳头砸在肉体上的闷响盖过了一切。"
stop music fadeout 3.0
scene bg room0
"   "
scene bg room72
"警察" "这次算你正当防卫了......"
"警察" "那几个家伙不仅现在犯不少事，还有前科。"
"警察" "手机里的记录也全都是很好的犯罪证明。"
"警察" "还有，你。"
"警察突然指向了奉孝，让他吓了一跳。"
"警察" "鉴于你这次还算是受害者......"
"警察" "去看心理医生。"
"警察" "你俩一起，都去看。"
$ wu_head_img = "images/1.9.png"
$ guo_head_img = "images/2.5.png"
n2 "好的。"
n11 "好的。"
"警察" "那么，祝你们以后生活愉快。"
"......"
n11 "......"
n2 "......"
play music music21 fadein 5.0
scene bg room74
"“我们找个地方坐坐？”"
"好。"
scene bg room75
"“话说，你包呢？”"
"用来揍人，被扣留了。"
"上面还有血迹。"
"“真是力大砖飞啊。”"
"谢谢夸奖。"
scene bg room0 with dissolve
scene bg room73 with dissolve
n11 "居然还有樱花呢"
n2 "晚樱吧，我们这城市建设真好......"
n2 "要夏天了。"
n11 "对啊，要夏天了......"
n2 "之后呢，你准备怎么做？"
n11 "什么怎么做？"
n2 "你不是都看见了吗，我的那些照片，我的聊天记录，还有我的“男朋友们”。"
n11 "说的也是呢......"
n11 "总之，先老老实实每天都去学校吧。"
n11 "我......我想每天都和你在一起。"
n2 "嗯......"
n11 "还有，那些“男朋友”都作废了吧。"
n11 "所以，奉孝，我可以做你的男朋友吗？"
n2 "......"
n2 "不嫌弃我？"
n11 "在我眼里......奉孝一直都很漂亮，而且......"
n11 "而且奉孝知道很多，我都不懂，奉孝可以慢慢教我......"
n2 "......"
n2 "嗯，果然快夏天了，有点热了啊......"
n2 "我脱个外套，帮我拿一下包。"
n11 "好。"
n11 "!"
scene bg room76 with dissolve
"......"
"“请多指教啊，男朋友。”"
scene bg room0 with dissolve
"......"
"果然，要夏天了。"
"end 4/4"
"恋人"

$ persistent.lover_ending_unlocked = True
$ renpy.save_persistent()

return

label ne:
define music19 = "audio/Fall.mp3"
scene bg room3
"该去哪里找他......"
n11 "奉孝......"
play music music11
show bg room3 at screen_shake
pause 0.2
show bg room3
"“嗡————”"
stop music
play music music19 fadein 5.0
n11 "又是......陌生人发送的......"
n11 "？"
scene bg room64
"!"
"这家伙别太过分了......"
scene bg room0
"去哪里，去哪里找他？"
"应该是学校里的家伙，那......"
"奉孝应该还在学校。"
"我得去找他，我......"
scene bg room11
"要快一点......"
scene bg room27
"必须到他身边......"
scene bg room26
"去找他......"
scene bg room21
"他一定在那里......"
scene bg room22
"去找他......"
scene bg room0
"奉孝————"
"“你......为什么会在这里？”"
scene bg room67
"“要来陪陪我吗？”"
n11 "奉孝，我————"
"“紫鸾，我是一个很糟糕的人。”"
"“我认为人生是虚无的，痛苦是无边的，所以我用了糟糕的方式来逃避。”"
"“不如说是最糟糕的方式。”"
"“接着沉溺。”"
"“上瘾。”"
"“......”"
"“是我自找的......自作自受......”"
"“即使如此也要靠近我吗？”"
"我......"
"没有奉孝就不行......"
"我认为我的家人是我活着的意义，所以我疯了一般去抓那些幻觉。"
"可是有你在，我便可以脱离那个温柔的幻象。"
"奉孝......我......"
"只要有你在......"
"“即使是这样的我吗？”"
"“只要你。”"
"“看来你也是疯了......”"
"“不如说我们都疯了。”"
"“那，在火焰将我们都吞噬殆尽前，要一起逃走吗？”"
scene bg room0
"他向我伸出了手，正如初来那日一样。"
"我......"
"我不想再失去任何人了。"
"天台上，我们紧紧相拥。"
"至于去哪，都是之后的事了。"

"end3/4"
"失踪人口"

return

label be:
"漫无目的地在学校里找了一整天，接下来是城里，商店街、公园、咖啡厅......"
"去我们一起去过的每一个地方都找过了。"
"还是没有找到。"
"......"
"像是突然失踪了一般......"
play music music18 fadein 5.0
"嗡————"
"电话？难道是奉孝！"
"？" "喂？紫鸾？"
"医生？"
n3 "那个啊，给你说一件事......"
n3 "虽然原则上这样是不对的，但是他手机里只存了你的号码。"
n3 "郭奉孝在我们医院......我不太确定你是否应该来看望他。"
n11 "谢谢你，我......"
n11 "请告诉我房间号，我马上来！"
image bg room65 = "images/65.png"
scene bg room65
"只要能见到他......"
"见到他之后我......"
scene bg room0
"我......"
image bg room66 = "images/66.png"
scene bg room66 at scroll_up
"......"
"奉孝......"
"“真是的，本来醒来看到医生就有预感。”"
"“怎么还真把你叫来了。”"
"发生什么事了......"
"“很多很多难以解释的事吧......”"
"“算是我过去作恶多端累积下来的报应。”"
"“如你所见，算是自杀未遂，现在还活着。”"
"“......”"
"“紫鸾，以后不要再见了。”"
"！！！"
"奉孝！怎么这么突然————"
"“以后不要再见了......”"
"“也不要再联系了。”"
"可是奉孝......"
n3 "探望时间到，病人需要静养。"
n3 "很抱歉紫鸾，你应该离开了。"
"......"
scene bg room0
n3 "抱歉，他的情况也挺复杂的......"
n3 "等之后他主动联系你的时候，你再来吧。"
n11 "......"
"可是医生，之后呢？"
"他的号码变成了空号，公寓搬来了新住户。"
"老师说他转学了，医生说他不在这个城市了。"
"之后呢？"
"没有之后了。"
"就像这个人从未存在过一般......"
"突然就消失了。"
"我怀疑是我的幻觉更严重了，增加了去医院的次数。"
"医生却说他确实在，只是离开了。"
"不过积极治疗是好事。"
"......"
"总之......积极治疗吧。"
"end2/4"
"精神病人"


return