image bg room17 = "images/19.png"
image bg room18 = "images/20.png"
image bg room19 = "images/21.png"

label week3:
scene black
"week2 end"
"......"
"......"
scene bg room3
"week3"
"今天要干什么呢？"
menu:
    "去学校":
        pass
    "不去学校":
        jump week4

"今天也，去学校吧。"
if baozi_score >= 4:
        pass
else:
        jump week4
menu:
    "等一下。":
        $ baozi_score += 1
        n1 "得先给奉孝打电话确认他起床了没。"
        n1 "昨天等他差点等迟到。"
        play music music4
        "......"
        "......"
        "......"
        "......"
        stop music
        play music music3 fadein 3.0 loop
        "“奉孝”" "......"
        "“奉孝”" "......"
        n1 "快说两句话，不然又睡着了。"
        n1 "不要把我的电话像闹钟一样直接挂断了。"
        "“奉孝”" "......再......五分钟......"
        n1 "不要过一会儿又睡了。"
        "“奉孝”" "......两分钟......"
        n1 "现在就起来。"
        "“奉孝”" "好......"
        "对面没有动静了。"
        n1 "希望他已经起来了。"
        n1 "......"
        n1 "我出门了。"

    "出门吧。":
        pass

scene bg room17
"看来今天动作还比较快。"
"远远地能看见奉孝在公寓楼下等着了。"
n1 "早上好。"
$ guo_head_img = "images/2.1.png" 
n2 "早上好！"
n1 "......"
n1 "你受伤了吗？"
"嘴角裂开了，还有......脖子上是......"
n1 "怪不得起不来，女朋友？"
n2 "不是。"
n1 "那是另一边嘛，也对。"
n2 "......"
n1 "毕竟你很漂亮，无论男女都会喜欢你吧。"
n2 "......"
n2 "(不是这样的......）"
n1 "你今天好安静啊，很累吗？"
n1 "早饭我请你吃吧，包子怎么样？"
n2 "好啊。"

scene bg room18
n1 "耳钉很显眼啊，总是不由自主地一直注意那边。"
n2 "懂了吧，我的时尚小巧思。"
n1 "嗯，很漂亮。"
n2 "（一直在说漂亮什么的.....）"
n2 "那你呢，耳骨那里，装酷？"
n1 "传家宝之类的？"
n1 "好像是姐姐给我戴上的，记不清了。"
n2 "一直提姐姐，姐控吗？"
n1 "长姐如母吧.....父母以前也很忙....."
n2 "那弟弟呢，没怎么听你提过。"
n1 "中二期，有点难交流呢.....只听姐姐的话。"
n1 "通信方式也，把我拉黑了，有点伤心....."
n2 "那去问问姐姐？"
n1 "嗯....."
n1 "也行吧。"
n1 "该去看看她了....."
menu:
    "邀请奉孝一起去":
        $ baozi_score += 1
        n1 "这样的话，要和我一起去吗，稍微有一点远，在隔壁市。"
        n1 "周五放学就可以过去，然后我们可以在那边玩一个周末，周日再回来。"
        n1 "我给姐姐提过你，她很想见见你。"
        n2 "话都说到这个份上了，我当然没有理由拒绝。"
        $ wu_head_img = "images/1.1.png"
        n1 "我在她面前说了很多你的好话，她对你印象可好了。"
        n1 "实际上我的交友标准还挺高的。"
        n2 "可以啊。"
        n2 "这算是见家长吗？我荣幸之极。"
        n1 "啊，说起来。"
        n1 "姐姐以前是风纪委员，很讨厌不良的，你（点了一下脖子）稍微注意一下。"
        n2 "....."
        n2 "没问题。"

    "自己一个人去":
        n1 "得计划一下带什么慰问品了....."
        jump week4

if baozi_score >= 5:
    jump week3_2
else:
    jump week4

image bg room6 = "images/08.png"
label week3_2:
scene bg room6
$ wu_head_img = "images/1.png"
$ guo_head_img = "images/2.png" 
"星期五。"
"太阳还没下山，不急着去车站。"
"但总觉得心里有些不安。"
"去看望姐姐真的是正确的选择吗？"
"姐姐有提过她想见我吗？"
"上一次见面是什么时候？"
"姐姐的声音是什么样的？"
"......"
n1 "奉孝。"
menu:
    "要不我们不去了吧。":
        n1 "我觉得还是算了吧，感觉有点突然了。"
        n1 "我觉得有点打扰到姐姐了。"
        n1 "......"
        n2 "啊，是吗？那就算了吧。"
        n1 "嗯。"
        n2 "那我们还是去吃个饭吧，吃完饭再回去。"
        n2 "要去我家玩游戏吗，我这周才买的新游戏。"
        n1 "好啊。"
        jump week4
    "我们快点去车站吧，在太阳下山之前。":
        n2 "好啊,这么着急吗，你不吃点东西？"
        n1 "嗯。"
        n1 "我觉得还是早点去车站比较好，太阳下山了到那边就天黑了。"
        n1 "不知道为什么，我现在有一点紧张。"
        n2 "太久没见到家人是这样的，没什么好紧张的。"
        n2 "这不还有我陪你。"
    
image bg room20 = "images/22.png"
image bg room28 = "images/30.png"
image bg room29 = "images/31.png"
define music5 = "audio/耳鸣.mp3"
define music6 = "audio/crowd_talking.mp3"
scene bg room20
"到车站的时候，太阳还是开始落山了。"
"车站那边人很多，有点吵。"
"不知为何我开始有点烦躁。"
"(前方耳鸣注意音量！！！)"
play music music5
scene bg room28
n2 "......"
n2 "不舒服吗？"
n1 "有点......"
n1 "......可能，想到要回去......"
"真的需要回去吗？"
"回......"
"回哪？"
n2 "......"
n2 "没事吗？"
stop music
play music music6
scene bg room29
with Dissolve(1.0)
"郭奉孝轻轻抚摸着我的背。"
"......"
"感觉平静了很多。"
n1 "谢谢。"
n2 "实在是难受的话，要不不去了。"
n1 "嗯......"
n1 "......"
n1 "去吧，毕竟已经说好了。"
"......"
scene black
define music7 = "audio/時鳴り.mp3"
define music8 = "audio/Train.mp3"
play music music8 fadein 2.0 loop
image bg room30 = "images/32.png"
scene bg room30
"......"
"车上倒没什么人。"
"这节车厢貌似只有我和郭奉孝。"
n1 "......"
n2 "啊~好无聊，还有一个多小时吧。"
n2 "你平时玩游戏吗？"
n1 "不玩。"
n1 "不过你说的什么游戏。"
n2 "这个这个。"
"他从包里掏出来了一个像鸡蛋一样的游戏机。"
image overlay_1 = "33.png"
image overlay_2 = "33.1.png"
show overlay_1 at truecenter with dissolve
n1 "这个是什么？"
n2 "这是“大魏歌子”，可以养小宠物。"
n2 "它们需要悉心照料，不然很容易去世的。"
n1 "......"
"想起来了，之前有一天体育课下课看他特别着急地回了教室，原来是为了这个游戏。"
"那一天他一直很消沉，嘴里念叨着什么“我的宝宝死了，呜呜。”"
n1 "那你现在养了什么宠物。"
n2 "哼哼，我给你看看，我养得可好了。"
show overlay_2 at truecenter with dissolve
hide overlay_1
"壶？"
n1 "......"
n1 "这是什么生物？"
n2 "这是酒壶仙人，能够制作出各种各样的美酒，庇佑爱酒的人，并且深爱着酒。"
n1 "......"
n1 "这个宠物也太奇怪了吧。"
n2 "很可爱啊，这个宠物是我最喜欢的。"
n2 "这个“大魏歌子”好像都是有角色原型的，我可能冥冥之中和这位原型有什么关系吧，直觉这么告诉我。"
n1 "......"
"要这么说，感觉，怪萌的。"
hide overlay_2
n2 "同系列还有一个想要称霸天下的邪恶六角蝾螈，忠实的独眼狗，神秘的包子精灵......"
"......"
"被安利了一路这个游戏。"
"感觉心情好了很多。"
stop music
define music9 = "audio/forest-chorus.mp3"
scene black
play music music9 fadein 2.0 loop
"......"
image bg room31 = "images/34.png"
image bg room32 = "images/35.png"
scene bg room31
"到达目的地的时候，天还是已经黑了。"
n2 "感觉凉飕飕的，有点阴森。"
n1 "嗯......"
n1 "毕竟是医院嘛，而且天黑了。"
n1 "夏天会好很多吧。"
$ wu_head_img = "images/1.1.png"
n1 "害怕的话可以牵着我的手。"
n2 "真的吗？"
n1 "开玩笑的。"
n2 "什么啊让我白高兴了。"
n1 "......"
n1 "等到了夏天，有试胆大会的话，那就真的可以牵了。"
n2 "好啊！我记住了！不许反悔！"
n1 "嗯。"
$ wu_head_img = "images/1.png"
scene bg room32
"这个时间，医院里人也不多，各种方面都是好事。"
n2 "没什么人啊，是好事。"
n1 "嗯......"
"还是有奇怪的感觉......"
"值班护士" "啊，你是......"
n2 "(他已经被护士记住了啊......)"
n1 "我是......我来看望————"
"值班护士" "医生在4楼13号房间等你。"
n1 "啊......好的，谢谢。"
"......"
"不对劲......"
"我需要先见医生吗？"
"哪位医生？有什么特别需要交代的事情吗？"
"不对劲......"
n2 "紫......你没事吗？"
n1 "......我......"
n1 "我不好说......"
n2 "......"
n2 "（这里不是外科）"
scene black
image bg room33 = "images/36.png"
image bg room34 = "images/36.1.png"
scene bg room33
n1 "你好，我是......"
"医生" "说实话，你最近状态不太好，你应该更早一点来复诊的。"
n2 "......"
n2 "(果然......)"
n1 "那个，医生，你在说什么啊？我很好啊，我是来看望我姐姐的，她最近怎么样？"
"医生" "......"
"医生" "虽然我有预感......"
"医生" "（看向奉孝）你是经常和他一起的那位新朋友吧，你应该也感觉到了吧？"
n2 "......我需要回避一下吗？"
"医生" "可能需要你，多陪他一段时间。"
n1 "你们在说什么？"
"医生沉默了一阵，又长叹了一口气。"
"医生" "你的名字是紫鸾，20xx年生，家人有父母，姐姐，还有弟弟。"
"医生" "两年前的深夜，你的家里因为事故发生了火灾，你的父母在睡梦中离开了。"
$ wu_head_img = "images/1.3.png"
stop music fadeout 5.0
"为什么又要和我讲这些......"
"......"
"两年前？"
"医生" "你的姐姐朱和是一个聪明又善良的女孩，她最先注意到了这一切，把你叫了起来。"
"医生" "自己再去找弟弟和父母。"
"医生" "......"
"医生" "她一直替弟弟捂着口鼻，逃了出来......"
"医生" "......"
"医生" "很遗憾，最后只有你和弟弟活下来了。"
"（音量注意耳鸣预警！！！）"
stop music fadeout 3.0
play music music5 fadein 3.0 loop
define music10 = "audio/tv-static-noise.mp3"
"他到底在说什么啊......"
scene bg room34
"医生" "我知道这件事情很难让人接受......这对你和小弟都是不小的打击。"
"医生" "你们的状态都不太好，即使肉体恢复了，精神上的创伤也难以愈合。"
"医生" "我是你的心理医生元化，我想你应该忘了吧......"
stop music
#这里替换成立绘和名称
n3 "你的情况......一直都不太乐观。"
play music music10
n3 "你经常会有一些幻觉，听到一些声音，看到一些东西，仿佛你姐姐从未离开。"
n3 "你记不清时间，分不清虚实，甚至忘记过去发生的事。"
n1 "可是我有在......和姐姐发消息啊......"
n3 "......很抱歉，一直在和你通信的是我。"
n3 "我应该早点注意到......"
scene black
"他到底在说什么？"
"我明明......"
"我忘了？"
"那我又是......"
"？"
define music1 = "audio/全て無くなった刹那.mp3"
play music music1 fadein 1.0 loop
scene bg room32
n2 "紫鸾。"
n2 "紫鸾！"
n11 "啊，抱歉，我......"
n11 "......"
$ wu_head_img = "images/1.5.png"
n11 "......我......"
n11 "奉孝，我该怎么办才好？"
"我怎么可以忘记......"
"怎么过去那么久了......"
"我活下来了，我却不记得......"
n11 "我......"
"悲伤，羞愧，愤怒，无奈。"
"所有的情绪在一瞬间涌上头。"
"我本就不剩下多少了......可我却忘记了她为我所做的一切......"
"苟且偷生着......"
"我有愧于她......"
"啊......"
n11 "我真的......"
"我怎么能忘记......还用她还活着的假象逃避......"
"我怎么可以......"
n11 "我对不起她，明明是她用命救下来的......"
n11 "我却不记得。"
n11 "我一直在逃避。"
n11 "一直在骗自己。"
n11 "我......"
"......"
n2 "你没有做错任何事。"
"在我彻底坠入黑暗的瞬间，一个温暖的怀抱将我包裹住。"
image bg room35 = "images/37.1.png"
image bg room36 = "images/37.2.png"
image bg room37 = "images/37.png"
scene bg room35
"“你承担了太多了。”"
"......"
"“你是幸存者，但也是受害者。”"
"“幻想也好，遗忘也好，逃避也好。”"
"“只要你好好活着。”"
"“只要你接下里的日子幸福。”"
scene bg room36
"“她一定也是这么想的。”"
"“她不会怪罪你，她只希望你接下里的日子里幸福。”"
"“她看见你这样，她会心疼你的。”"
"“你没有做错任何事，你做得很好。”"
"“吃喜欢的食物，看喜欢的景色。”"
"“你会带着她的份幸福的。”"
"“所以......”"
scene bg room37
"“好好生活吧。”"
"“我会陪着你。”"
"“我们一起......”"
"“一起过上幸福的生活。"
"......"
"如果......"
"如果我们真的可以......"
"这些幸福的瞬间......"
"多想留住......"
"在这里停下......"
"......"
stop music fadeout 5.0
image bg room38 = "images/38.png"
scene bg room38
jump week4


